#include <iostream>
#include <string>
using namespace std;

/*Побудувати клас для роботи з однозв’язним списком. 
Елемент списку містить наступну інформацію про автобус: 
номер автобуса; 
прізвище та ініціали водія; 
номер маршруту. 

Програма повинна забезпечувати: 
початкове формування двох списків: 
з даними про автобуси, які знаходяться в автопарку; 
з даними про автобуси, які знаходяться на маршрутах. 
При виїзді кождого автобуса з парку вводиться номер автобуса, і програма видаляє дані про цей автобус з списку автобусів, 
які знаходяться в автопарку, та записує ці дані в список автобусів, які знаходяться на маршруті. 
аналогічна операція виконується для списків, якщо якийсь автобус повертається в автопарк; 
по запиту видіються відомості про автобуси, які знаходяться в автопарку або на маршруті. 
*/

int main()
{


	system("pause");
	return 0;
}