#include "Fish.h"
#include <iostream>
#include <string>
using namespace std;

/*Завдання 3.
Створити клас Риба з наступними полями
 координати (х, у)
 поле здоров’я( чим більше значення, тим більш сита риба); при значенні 0 риба
помирає
статичними полями :
 океан(озеро), де можуть переміщатися екземпляри класу Риба : двовимірний масив
 число живих екземплярів риб
та методами:
 конструктор(и)
 метод зображення риби
 метод приховування риби
 метод переміщення риби
Протестувати роботу класу: створити декілька екземплярів риб, помістити їх у &quot;океан&quot;,
вивести на екран кількість екземплярів риб.
Передбачити переміщення риб по &quot;океану&quot;. З кожним переміщенням почуття голоду риб
росте(здоров’я зменшується).
*Удосконалити клас Риба . У &quot;океані&quot; &quot;ростуть&quot; водорості. Риби збільшують своє
здоров’я, якщо при переміщенні натрапляють на водорість.*/

static int counter = 0;
static int ocean[10][10];

Fish::Fish()
{
}

Fish::Fish(string nameFish, int x, int y, int health)
{
	this->nameFish = nameFish;
	this->x = x;
	this->y = y;
	this->health = health;
	
	
}

void Fish::ShowInfoFish()
{
	cout << nameFish <<" coordinates: " << "(" << x << ";" << y << ")   Health: " << health << endl;
}


void Fish::PrintOcean()
{
	for (int i = 0; i < 10; i++)
	{
		for (int j = 0; j < 10; j++)
		{
			if (i == 0 || i == 10-1 && j ==0 || j==10-1)
			{
				cout << "*" << endl;
			}
		}
	}
}

Fish::~Fish()
{
}
