#include <iostream>
#include <string>
#include <ctime>
#include "Fish.h"

using namespace std;
/*Завдання 3.
Створити клас Риба з наступними полями
 координати (х, у)
 поле здоров’я( чим більше значення, тим більш сита риба); при значенні 0 риба
помирає
статичними полями :
 океан(озеро), де можуть переміщатися екземпляри класу Риба : двовимірний масив
 число живих екземплярів риб
та методами:
 конструктор(и)
 метод зображення риби
 метод приховування риби
 метод переміщення риби
Протестувати роботу класу: створити декілька екземплярів риб, помістити їх у &quot;океан&quot;,
вивести на екран кількість екземплярів риб.
Передбачити переміщення риб по &quot;океану&quot;. З кожним переміщенням почуття голоду риб
росте(здоров’я зменшується).
*Удосконалити клас Риба . У &quot;океані&quot; &quot;ростуть&quot; водорості. Риби збільшують своє
здоров’я, якщо при переміщенні натрапляють на водорість.*/

int main()
{

	Fish fish("Okun", 5, 10, 15);
	fish.ShowInfoFish();


	system("pause");
	return 0;
}