#include <iostream>
#include <string>
#include "Shop.h"
#include "Book.h"
#include "AudioDisk.h"
#include "Magazine.h"
using namespace std;
/*ООП
Постановка задачі
Є магазин "Веселка". В даному магазині продається наступна продукція:
книжки;
журнали;
аудіо диски.
Всі три види продукції представлені відповідними класами: Книга (Book), Журнал (Megazine), Аудіо диск (Audio). Програма має виводити наступні результати:
Виводити інформацію про всі книги, журнали і/або аудіо диски.
Виводити інформацію про найдорожчу книжку, журнал і/або аудіо диск.
Виводити інформацію про найдешевшу книжку, журнал і/або аудіо диск.
Виводити середню ціну книг, журналів і/або аудіо дисків.
Виводити нові книги, журнали і/або аудіо диски. */

int main()
{

	Book book1("Kobzar", "Shevchenko", 400, 2018, 328);
	book1.ShowInfoBook();
	cout << "**********************************************" << endl;
	Magazine magazine1("Vogue", "Svitanok", 60, 2017, 60);
	magazine1.ShowInfoMagazine();
	cout << "**********************************************" << endl;
	AudioDisk disk1("English", "Paisadini", 2019, 200);
	disk1.ShowInfoDisk();
	cout << "**********************************************" << endl;

	system("pause");
	return 0;
}